example-files/secured-request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    
    <Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>user</wsse:Username>
                <wsse:Password>password</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </Header>
    <Body>
        <GetCourseDetailsRequest xmlns="http://mySchool/courses">
            <id>1</id>
        </GetCourseDetailsRequest>
    </Body>
</Envelope>